---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ForceOffset
source: html/f30370e6-0b0f-2e41-ac1e-d54fa189c672.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ForceOffset Property

True to create new local placement with identity transform.

## Syntax (C#)
```csharp
public bool ForceOffset { get; set; }
```